/*
 * Copyright 2020 Google LLC
 * SPDX-License-Identifier: MIT
 */

#ifndef VN_PROTOCOL_DRIVER_TYPES_H
#define VN_PROTOCOL_DRIVER_TYPES_H

#include "vn_protocol_driver_defines.h"

/* uint64_t */

static inline size_t
vn_sizeof_uint64_t(const uint64_t *val)
{
    assert(sizeof(*val) == 8);
    return 8;
}

static inline void
vn_encode_uint64_t(struct vn_cs *cs, const uint64_t *val)
{
    vn_encode(cs, 8, val, sizeof(*val));
}

static inline void
vn_decode_uint64_t(struct vn_cs *cs, uint64_t *val)
{
    vn_decode(cs, 8, val, sizeof(*val));
}

static inline size_t
vn_sizeof_uint64_t_array(const uint64_t *val, uint32_t count)
{
    assert(sizeof(*val) == 8);
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    return size;
}

static inline void
vn_encode_uint64_t_array(struct vn_cs *cs, const uint64_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_encode(cs, size, val, size);
}

static inline void
vn_decode_uint64_t_array(struct vn_cs *cs, uint64_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_decode(cs, size, val, size);
}

/* int32_t */

static inline size_t
vn_sizeof_int32_t(const int32_t *val)
{
    assert(sizeof(*val) == 4);
    return 4;
}

static inline void
vn_encode_int32_t(struct vn_cs *cs, const int32_t *val)
{
    vn_encode(cs, 4, val, sizeof(*val));
}

static inline void
vn_decode_int32_t(struct vn_cs *cs, int32_t *val)
{
    vn_decode(cs, 4, val, sizeof(*val));
}

static inline size_t
vn_sizeof_int32_t_array(const int32_t *val, uint32_t count)
{
    assert(sizeof(*val) == 4);
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    return size;
}

static inline void
vn_encode_int32_t_array(struct vn_cs *cs, const int32_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_encode(cs, size, val, size);
}

static inline void
vn_decode_int32_t_array(struct vn_cs *cs, int32_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_decode(cs, size, val, size);
}

/* enum VkStructureType */

static inline size_t
vn_sizeof_VkStructureType(const VkStructureType *val)
{
    assert(sizeof(*val) == sizeof(int32_t));
    return vn_sizeof_int32_t((const int32_t *)val);
}

static inline void
vn_encode_VkStructureType(struct vn_cs *cs, const VkStructureType *val)
{
    vn_encode_int32_t(cs, (const int32_t *)val);
}

static inline void
vn_decode_VkStructureType(struct vn_cs *cs, VkStructureType *val)
{
    vn_decode_int32_t(cs, (int32_t *)val);
}

/* size_t */

static inline size_t
vn_sizeof_size_t(const size_t *val)
{
    return vn_sizeof_uint64_t(&(uint64_t){ *val });
}

static inline void
vn_encode_size_t(struct vn_cs *cs, const size_t *val)
{
    const uint64_t tmp = *val;
    vn_encode_uint64_t(cs, &tmp);
}

static inline void
vn_decode_size_t(struct vn_cs *cs, size_t *val)
{
    uint64_t tmp;
    vn_decode_uint64_t(cs, &tmp);
    *val = tmp;
}

static inline size_t
vn_sizeof_size_t_array(const size_t *val, uint32_t count)
{
    return vn_sizeof_size_t(val) * count;
}

static inline void
vn_encode_size_t_array(struct vn_cs *cs, const size_t *val, uint32_t count)
{
    if (sizeof(size_t) == sizeof(uint64_t)) {
        vn_encode_uint64_t_array(cs, (const uint64_t *)val, count);
    } else {
        for (uint32_t i = 0; i < count; i++)
            vn_encode_size_t(cs, &val[i]);
    }
}

static inline void
vn_decode_size_t_array(struct vn_cs *cs, size_t *val, uint32_t count)
{
    if (sizeof(size_t) == sizeof(uint64_t)) {
        vn_decode_uint64_t_array(cs, (uint64_t *)val, count);
    } else {
        for (uint32_t i = 0; i < count; i++)
            vn_decode_size_t(cs, &val[i]);
    }
}

/* opaque blob */

static inline size_t
vn_sizeof_blob_array(const void *val, size_t size)
{
    return (size + 3) & ~3;
}

static inline void
vn_encode_blob_array(struct vn_cs *cs, const void *val, size_t size)
{
    vn_encode(cs, (size + 3) & ~3, val, size);
}

static inline void
vn_decode_blob_array(struct vn_cs *cs, void *val, size_t size)
{
    vn_decode(cs, (size + 3) & ~3, val, size);
}

/* array size (uint64_t) */

static inline size_t
vn_sizeof_array_size(uint64_t size)
{
    return vn_sizeof_uint64_t(&size);
}

static inline void
vn_encode_array_size(struct vn_cs *cs, uint64_t size)
{
    vn_encode_uint64_t(cs, &size);
}

static inline uint64_t
vn_decode_array_size(struct vn_cs *cs, uint64_t max_size)
{
    uint64_t size;
    vn_decode_uint64_t(cs, &size);
    if (size > max_size) {
        vn_cs_set_error(cs);
        size = 0;
    }
    return size;
}

static inline uint64_t
vn_peek_array_size(struct vn_cs *cs)
{
    uint64_t size;
    vn_cs_in_peek(cs, &size, sizeof(size));
    return size;
}

/* non-array pointer */

static inline size_t
vn_sizeof_simple_pointer(const void *val)
{
    return vn_sizeof_array_size(val ? 1 : 0);
}

static inline bool
vn_encode_simple_pointer(struct vn_cs *cs, const void *val)
{
    vn_encode_array_size(cs, val ? 1 : 0);
    return val;
}

static inline bool
vn_decode_simple_pointer(struct vn_cs *cs)
{
    return vn_decode_array_size(cs, 1);
}

/* uint32_t */

static inline size_t
vn_sizeof_uint32_t(const uint32_t *val)
{
    assert(sizeof(*val) == 4);
    return 4;
}

static inline void
vn_encode_uint32_t(struct vn_cs *cs, const uint32_t *val)
{
    vn_encode(cs, 4, val, sizeof(*val));
}

static inline void
vn_decode_uint32_t(struct vn_cs *cs, uint32_t *val)
{
    vn_decode(cs, 4, val, sizeof(*val));
}

static inline size_t
vn_sizeof_uint32_t_array(const uint32_t *val, uint32_t count)
{
    assert(sizeof(*val) == 4);
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    return size;
}

static inline void
vn_encode_uint32_t_array(struct vn_cs *cs, const uint32_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_encode(cs, size, val, size);
}

static inline void
vn_decode_uint32_t_array(struct vn_cs *cs, uint32_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_decode(cs, size, val, size);
}

/* float */

static inline size_t
vn_sizeof_float(const float *val)
{
    assert(sizeof(*val) == 4);
    return 4;
}

static inline void
vn_encode_float(struct vn_cs *cs, const float *val)
{
    vn_encode(cs, 4, val, sizeof(*val));
}

static inline void
vn_decode_float(struct vn_cs *cs, float *val)
{
    vn_decode(cs, 4, val, sizeof(*val));
}

static inline size_t
vn_sizeof_float_array(const float *val, uint32_t count)
{
    assert(sizeof(*val) == 4);
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    return size;
}

static inline void
vn_encode_float_array(struct vn_cs *cs, const float *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_encode(cs, size, val, size);
}

static inline void
vn_decode_float_array(struct vn_cs *cs, float *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_decode(cs, size, val, size);
}

/* uint8_t */

static inline size_t
vn_sizeof_uint8_t(const uint8_t *val)
{
    assert(sizeof(*val) == 1);
    return 4;
}

static inline void
vn_encode_uint8_t(struct vn_cs *cs, const uint8_t *val)
{
    vn_encode(cs, 4, val, sizeof(*val));
}

static inline void
vn_decode_uint8_t(struct vn_cs *cs, uint8_t *val)
{
    vn_decode(cs, 4, val, sizeof(*val));
}

static inline size_t
vn_sizeof_uint8_t_array(const uint8_t *val, uint32_t count)
{
    assert(sizeof(*val) == 1);
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    return (size + 3) & ~3;
}

static inline void
vn_encode_uint8_t_array(struct vn_cs *cs, const uint8_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_encode(cs, (size + 3) & ~3, val, size);
}

static inline void
vn_decode_uint8_t_array(struct vn_cs *cs, uint8_t *val, uint32_t count)
{
    const size_t size = sizeof(*val) * count;
    assert(size >= count);
    vn_decode(cs, (size + 3) & ~3, val, size);
}

/* typedef uint32_t VkSampleMask */

static inline size_t
vn_sizeof_VkSampleMask(const VkSampleMask *val)
{
    return vn_sizeof_uint32_t(val);
}

static inline void
vn_encode_VkSampleMask(struct vn_cs *cs, const VkSampleMask *val)
{
    vn_encode_uint32_t(cs, val);
}

static inline void
vn_decode_VkSampleMask(struct vn_cs *cs, VkSampleMask *val)
{
    vn_decode_uint32_t(cs, val);
}

static inline size_t
